benchmark_report/wrk_results_8177/wrk_100concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    40.40ms  177.00ms   1.50s    96.28%
    Req/Sec     0.99k    75.16     1.19k    86.82%
  Latency Distribution
     50%    8.10ms
     75%    8.87ms
     90%    9.66ms
     99%    1.16s 
  356008 requests in 31.57s, 32.59MB read
Requests/sec:  11278.29
Transfer/sec:      1.03MB