benchmark_report/wrk_results_8177/wrk_200concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   139.96ms  303.35ms   1.98s    86.63%
    Req/Sec     0.97k   192.71     1.57k    69.38%
  Latency Distribution
     50%   11.77ms
     75%   14.20ms
     90%  614.58ms
     99%    1.35s 
  347760 requests in 32.01s, 31.84MB read
  Socket errors: connect 0, read 0, write 0, timeout 136
Requests/sec:  10865.15
Transfer/sec:      0.99MB