benchmark_report/wrk_results_8177/wrk_400concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   183.38ms  319.34ms   1.91s    83.06%
    Req/Sec     0.93k   252.83     1.98k    70.76%
  Latency Distribution
     50%   12.61ms
     75%  207.80ms
     90%  753.88ms
     99%    1.20s 
  334595 requests in 31.56s, 30.63MB read
  Socket errors: connect 0, read 0, write 0, timeout 1053
Requests/sec:  10601.53
Transfer/sec:      0.97MB