benchmark_report/wrk_results_8177/wrk_600concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 600 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   197.07ms  340.28ms   1.90s    83.19%
    Req/Sec     0.94k   282.99     2.21k    71.27%
  Latency Distribution
     50%   12.63ms
     75%  239.96ms
     90%  796.61ms
     99%    1.26s 
  336633 requests in 31.89s, 30.82MB read
  Socket errors: connect 0, read 0, write 0, timeout 2072
Requests/sec:  10556.61
Transfer/sec:      0.97MB