benchmark_report/wrk_results_8177/wrk_800concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   168.31ms  323.74ms   1.91s    84.94%
    Req/Sec     0.92k   301.77     2.28k    70.61%
  Latency Distribution
     50%   12.59ms
     75%   87.77ms
     90%  724.26ms
     99%    1.25s 
  309501 requests in 30.04s, 28.34MB read
  Socket errors: connect 0, read 0, write 0, timeout 2712
Requests/sec:  10303.35
Transfer/sec:      0.94MB